trade_exp/src/Documents/ВыводИзОборотаИСМП/ВыводИзОборотаИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="09df1983-6b98-4c03-92c9-79f8c54278d4">
  <name>ВыводИзОборотаИСМП</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="0668885e-d3ff-414a-a2dc-b06d1809db97">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="792920ec-82a9-47f9-af50-8c1a7791efe2">
    <name>ВидПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="823ad4de-0b6d-4d23-8fcf-85d22d162b0d">
    <name>ОбъемноСортовойУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="98da477f-2a38-4749-a3cf-6fb60beff1a9">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33f80f9a-d1db-44d7-88a2-010085531075">
    <name>ОписаниеПричины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c6ab49a0-8398-414f-8f90-c4393902d3ac">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="69bb5c6c-bd96-4706-8176-d31e567ae998">
    <name>ВидПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7df4f79b-40d1-46fc-9654-9a46f729ca51">
    <name>НаименованиеПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d12b6140-8712-4788-8eec-2e686bfd5c85">
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dcface5d-8ac6-49de-a3dc-37fe8bee229d">
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="904fa363-e6d6-4637-8c74-a71b7b13bddc">
    <name>АдресПлощадкиСтрокой</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7119219-4520-44ae-8e97-393051a44399">
    <name>ИдентификаторГосударственногоКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="971d05b7-80ea-43f4-8b38-108f6daec3eb">
    <name>СтранаНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3e0cc035-3286-42a6-877e-692da8c8d7e6">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="effa584c-89b4-46fd-b6f2-e725aa7f6192">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2796f73a-97ef-46e2-8b5b-cfc906aa89a0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37f67ac2-010b-4827-853c-ea0f44e90e1b">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="502dd611-ecb0-4681-8393-f4e8c884ab4b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a2e5739d-bb93-47d4-a20a-7c5fa31a22ae">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ee5bc727-df20-497f-808c-b460c37b744e">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="af355925-d329-4ec7-98ad-4029b494039b">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="e4bb2cc1-d229-4ca8-8a4c-ece2f7227bf4">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="56f33930-b80d-4da8-bbf1-773e8017b7de">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4da38fc1-0df5-47cc-81b9-0fb1ce279a6b">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8f0df66b-8496-47e3-b069-84091e444392">
      <name>GTIN</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6ab6f805-4ac7-4ddd-82b4-9bbe4e681068">
      <name>КоличествоПотребительскихУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9b37054d-f284-4721-a6dd-ee224b4b2293">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="93774d68-4934-409b-9992-f29468a874cf">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="23212ab4-0bc2-43b7-a1db-3b9cb934526a">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a37e605b-5f74-4374-b443-8f3285ffe20e">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4b095f24-e6e3-446b-98d5-8d6682897a27">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cbf8309e-7be7-40be-bf2e-f911b0de5661">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="049c20bb-8154-49c7-890f-44ce07ce023e">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ВыводИзОборотаИСМП/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции	

Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ВыводИзОборотаИСМП") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		Док_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументСсылка);
		
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("ДвижениеМаркированногоТовара"); 
	
КонецПроцедуры

Процедура Док_ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
  	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
 
КонецПроцедуры

Функция ТекстЗапросаТаблицаДвижениеМаркированногоТовара(Запрос, ТекстыЗапроса, Регистры, ДокументОбъект) экспорт
	ИмяРегистра = "ДвижениеМаркированногоТовара";
	
	Если НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Штрихкоды.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Штрихкоды.Ссылка.Склад КАК Склад,
	|	Штрихкоды.Ссылка.Организация КАК Организация,
	|	Штрихкоды.ШтрихкодУпаковки КАК Штрихкод,
	|	ШтрихкодыУпаковка.Ссылка КАК ШтрихкодУпаковки,
	|	1 КАК Количество
	|ИЗ
	|	Документ.ВыводИзОборотаИСМП.ШтрихкодыУпаковок КАК Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковка
	|		ПО Штрихкоды.ШтрихкодУпаковки = ШтрихкодыУпаковка.Штрихкод
	|ГДЕ
	|	Штрихкоды.Ссылка = &Ссылка";
	//|	И ВЫБОР
	//|			КОГДА Штрихкоды.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении
	//|					И Штрихкоды.Ссылка.Дата >= Штрихкоды.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении
	//|				ТОГДА ЛОЖЬ
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ";	
	
  	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли
